[{"id": 1, "time_start": "00:00:05.040", "time_end": "00:00:12.750", "dialogue": "Kwong Yue Yang: quick question have I have we done self introductions have I put you in a breakout we've had to do a self introduction."}, {"id": 2, "time_start": "00:00:14.340", "time_end": "00:00:15.240", "dialogue": "Kwong Yue Yang: Does that ring a bell."}, {"id": 3, "time_start": "00:00:16.560", "time_end": "00:00:17.670", "dialogue": "Lexandra Confiado: yep yes."}, {"id": 4, "time_start": "00:00:18.270", "time_end": "00:00:29.970", "dialogue": "Kwong Yue Yang: Okay, good so we talked about, starting with the same I gave the we did the introduction and then we did the second introduction, where the second introduction was more engaging correct."}, {"id": 5, "time_start": "00:00:31.620", "time_end": "00:00:40.020", "dialogue": "Kwong Yue Yang: yep alright allison's nodding, so i'm assuming allison is representing everyone, so we had this idea of starting we've seen."}, {"id": 6, "time_start": "00:00:41.220", "time_end": "00:00:45.600", "dialogue": "Kwong Yue Yang: How the different ways we can start with a scene to hook, the audience."}, {"id": 7, "time_start": "00:00:47.490", "time_end": "00:00:50.100", "dialogue": "Kwong Yue Yang: What can we do this, the audience allison."}, {"id": 8, "time_start": "00:00:50.580", "time_end": "00:00:54.030", "dialogue": "Alyson Sosa: present a problem, and then, given the fact that we're the problem solver."}, {"id": 9, "time_start": "00:00:54.240", "time_end": "00:00:58.710", "dialogue": "Kwong Yue Yang: yeah great giving them problem and show them that were the problem solver what else."}, {"id": 10, "time_start": "00:01:01.800", "time_end": "00:01:02.640", "dialogue": "Lexandra Confiado: Stay a quote."}, {"id": 11, "time_start": "00:01:03.120", "time_end": "00:01:05.700", "dialogue": "Kwong Yue Yang: Yet stated quote great stated quote."}, {"id": 12, "time_start": "00:01:08.220", "time_end": "00:01:08.730", "dialogue": "Kwong Yue Yang: What else."}, {"id": 13, "time_start": "00:01:11.250", "time_end": "00:01:12.060", "dialogue": "Kwong Yue Yang: We can."}, {"id": 14, "time_start": "00:01:13.170", "time_end": "00:01:14.160", "dialogue": "Kwong Yue Yang: ask a question."}, {"id": 15, "time_start": "00:01:15.960", "time_end": "00:01:18.750", "dialogue": "Kwong Yue Yang: yep we can ask a question, we can tell a story."}, {"id": 16, "time_start": "00:01:19.980", "time_end": "00:01:21.060", "dialogue": "Kwong Yue Yang: We can also maybe we'll."}, {"id": 17, "time_start": "00:01:22.500", "time_end": "00:01:22.800", "dialogue": "Kwong Yue Yang: start."}, {"id": 18, "time_start": "00:01:23.730", "time_end": "00:01:24.540", "dialogue": "Arunabh Singh: sharing a picture."}, {"id": 19, "time_start": "00:01:24.990", "time_end": "00:01:26.580", "dialogue": "Kwong Yue Yang: share a picture sharing image."}, {"id": 20, "time_start": "00:01:26.610", "time_end": "00:01:28.050", "dialogue": "Arunabh Singh: gracious yeah."}, {"id": 21, "time_start": "00:01:28.560", "time_end": "00:01:31.500", "dialogue": "Kwong Yue Yang: Excellent all those are different ways we can."}, {"id": 22, "time_start": "00:01:32.580", "time_end": "00:01:34.830", "dialogue": "Kwong Yue Yang: capture our audience's attention."}, {"id": 23, "time_start": "00:01:36.300", "time_end": "00:01:45.540", "dialogue": "Kwong Yue Yang: So in today's session today's session in a second i'm going to break you out into groups again this time what i'd like you to do."}, {"id": 24, "time_start": "00:01:46.410", "time_end": "00:02:10.680", "dialogue": "Kwong Yue Yang: Is we're focusing imagine that you're about to speak to MBA graduates imagine you're about to speak to MBA graduates and what you'd like to do is to convince these MBA graduates to come work at city to come work at city, so the idea here is to tell the story of of CRM."}, {"id": 25, "time_start": "00:02:12.270", "time_end": "00:02:18.420", "dialogue": "Kwong Yue Yang: tell the story of CRM in 60 seconds trying to convince them to come join the team."}, {"id": 26, "time_start": "00:02:19.740", "time_end": "00:02:20.820", "dialogue": "Kwong Yue Yang: Everyone clear on that."}, {"id": 27, "time_start": "00:02:22.170", "time_end": "00:02:29.400", "dialogue": "Kwong Yue Yang: yep excellent, so let me put you in a breakout rooms Now a few things a few parameters."}, {"id": 28, "time_start": "00:02:31.170", "time_end": "00:02:32.790", "dialogue": "Kwong Yue Yang: same as."}, {"id": 29, "time_start": "00:02:34.470", "time_end": "00:02:45.810", "dialogue": "Kwong Yue Yang: Last time, some of the parameters are one is going to be 60 seconds or less to everybody needs to be evolved."}, {"id": 30, "time_start": "00:02:47.490", "time_end": "00:03:04.230", "dialogue": "Kwong Yue Yang: Three what i'd like you to do is start implementing some of the things that we've learned so start with the scene, think about how you can start with the scene and then think about things like being different or lowering filters, how can you implement some of the thing that we've learned."}, {"id": 31, "time_start": "00:03:06.690", "time_end": "00:03:12.420", "dialogue": "Kwong Yue Yang: What was also one major thing that we learned last time, especially during the feedback."}, {"id": 32, "time_start": "00:03:15.330", "time_end": "00:03:19.170", "dialogue": "Kwong Yue Yang: Was the thing was to make sure that you tell people what you're going to."}, {"id": 33, "time_start": "00:03:19.200", "time_end": "00:03:25.590", "dialogue": "Kwong Yue Yang: share with them bridge to what you're going to share and then at the end summarize what you've just shared with them."}, {"id": 34, "time_start": "00:03:26.370", "time_end": "00:03:39.330", "dialogue": "Kwong Yue Yang: Right so try to have a nice structure open with something creative give them that main piece of content and then end with something that hopefully loops back to the opening or has a nice strong conclusion."}, {"id": 35, "time_start": "00:03:40.860", "time_end": "00:03:44.250", "dialogue": "Kwong Yue Yang: Right, so let me put you on two groups."}, {"id": 36, "time_start": "00:03:48.000", "time_end": "00:03:51.510", "dialogue": "Kwong Yue Yang: You have to recreate these rooms those three groups today."}, {"id": 37, "time_start": "00:03:56.730", "time_end": "00:04:01.740", "dialogue": "Kwong Yue Yang: rooms in a group and then David will be in a group and allison are okay, not a problem."}, {"id": 38, "time_start": "00:04:04.950", "time_end": "00:04:06.300", "dialogue": "Kwong Yue Yang: Everyone clear on the instructions."}, {"id": 39, "time_start": "00:04:07.560", "time_end": "00:04:08.370", "dialogue": "Kwong Yue Yang: Any questions."}, {"id": 40, "time_start": "00:04:09.900", "time_end": "00:04:24.360", "dialogue": "Kwong Yue Yang: Looking looking looking going once going twice no questions okay off we go give everyone eight minutes should be plenty of time and we'll see how we go all right also pop into the rooms to say hi and see how things are going."}, {"id": 41, "time_start": "00:05:00.450", "time_end": "00:05:01.380", "dialogue": "Lynette K: hi everyone."}, {"id": 42, "time_start": "00:05:02.790", "time_end": "00:05:11.880", "dialogue": "Lynette K: finds against financial institutions has reached 4.6 sorry 10 $10.4 billion just in 2020 alone."}, {"id": 43, "time_start": "00:05:12.990", "time_end": "00:05:25.380", "dialogue": "Lynette K: With so many regulators and so many complicated regulations have you wondered who manages these regulators have impacted these outcome and who monitors these transaction in large organization like city."}, {"id": 44, "time_start": "00:05:27.030", "time_end": "00:05:39.840", "dialogue": "David Hsu: city ml, not only do we spend a lot of time to design the account opening requirements, but what's more important behind the scene is we spending lots of time and resources."}, {"id": 45, "time_start": "00:05:40.110", "time_end": "00:05:49.500", "dialogue": "David Hsu: To develop using big data and artificial intelligence transaction monitoring tools to help us detect suspicious transactions."}, {"id": 46, "time_start": "00:05:50.130", "time_end": "00:06:03.180", "dialogue": "David Hsu: So if you come and join city see how exciting, it will be because not only do you get to learn about the latest technology, we can use the latest technology to help us in the fight against financial crime."}, {"id": 47, "time_start": "00:06:05.910", "time_end": "00:06:25.050", "dialogue": "Paul Lee: So you hear about this, we can sit, it is not a traditional bank, we are so more so much innovative and we use about big data artificial intelligence to help us to do our job so it's now the time to come to john city."}, {"id": 48, "time_start": "00:06:30.990", "time_end": "00:06:32.970", "dialogue": "Kwong Yue Yang: Nice nice nice like."}, {"id": 49, "time_start": "00:06:35.130", "time_end": "00:06:38.280", "dialogue": "Kwong Yue Yang: All right, what's the what's the question you'd like to ask."}, {"id": 50, "time_start": "00:06:40.680", "time_end": "00:06:41.760", "dialogue": "Lynette K: What have we done well."}, {"id": 51, "time_start": "00:06:42.750", "time_end": "00:06:45.000", "dialogue": "Kwong Yue Yang: What are they done well, what did they do well."}, {"id": 52, "time_start": "00:06:45.630", "time_end": "00:06:50.160", "dialogue": "Alyson Sosa: A great hook, we consider that one as well, giving that dylan number get everyone's attention."}, {"id": 53, "time_start": "00:06:51.060", "time_end": "00:06:51.660", "dialogue": "yeah."}, {"id": 54, "time_start": "00:06:52.770", "time_end": "00:07:06.210", "dialogue": "Alyson Sosa: I will say em pulse use of language in in his summary there like think saying like things like innovative big data Ai or you know, like key phrases at the moment and then that touch of ending with a question so getting them thinking when they finished."}, {"id": 55, "time_start": "00:07:08.070", "time_end": "00:07:09.540", "dialogue": "Kwong Yue Yang: Right wonderful what else."}, {"id": 56, "time_start": "00:07:10.350", "time_end": "00:07:24.690", "dialogue": "Lexandra Confiado: And then the next starting off with us, you know, a question or a statement around regulatory science which people are not really aware of, obviously, that you know gives a lot of curiosity, so that was a good touch or me."}, {"id": 57, "time_start": "00:07:25.710", "time_end": "00:07:28.680", "dialogue": "Kwong Yue Yang: yeah great hook great question at the beginning."}, {"id": 58, "time_start": "00:07:29.400", "time_end": "00:07:29.910", "dialogue": "What is."}, {"id": 59, "time_start": "00:07:31.020", "time_end": "00:07:41.850", "dialogue": "Arunabh Singh: Given David spark was very, very nice, I mean he explained it so very well, I was like trying to listen to what he was saying, so it was very well presented."}, {"id": 60, "time_start": "00:07:42.360", "time_end": "00:07:51.450", "dialogue": "Arunabh Singh: And the whole end to end if you look into what this from there, the started in the way Paul closed, I think it was very nice I would join city."}, {"id": 61, "time_start": "00:07:56.250", "time_end": "00:07:57.960", "dialogue": "Harish Ashok Mahadik: Especially David Simon I."}, {"id": 62, "time_start": "00:08:00.270", "time_end": "00:08:16.410", "dialogue": "Harish Ashok Mahadik: said i've heard David speaking multiple times before the way he shared a certain terms and the way he he articulates it shows a very clear line of thinking, so you, you are kind of compelled to follow the line of thought so."}, {"id": 63, "time_start": "00:08:17.760", "time_end": "00:08:20.730", "dialogue": "Harish Ashok Mahadik: Again, I mean, I must say I love that about this particular piece."}, {"id": 64, "time_start": "00:08:23.370", "time_end": "00:08:23.730", "dialogue": "Sophia Zhu: yeah."}, {"id": 65, "time_start": "00:08:24.180", "time_end": "00:08:26.400", "dialogue": "Arunabh Singh: It was very, very."}, {"id": 66, "time_start": "00:08:26.490", "time_end": "00:08:35.670", "dialogue": "Arunabh Singh: Current you know artificial intelligence innovation big data, these are the terminologies which really the new MBA graduates would want to hear and."}, {"id": 67, "time_start": "00:08:38.490", "time_end": "00:08:42.060", "dialogue": "Arunabh Singh: we're not sorry must be interfered sorry."}, {"id": 68, "time_start": "00:08:42.120", "time_end": "00:08:53.550", "dialogue": "Sophia Zhu: Apologies yeah I read all of those because I learned, or so I heard all the keywords and that really make my years you predict it from the middle of it, so I big data, etc."}, {"id": 69, "time_start": "00:08:54.780", "time_end": "00:08:59.400", "dialogue": "Sophia Zhu: also found that good energy in the hook was really in the opening band that was."}, {"id": 70, "time_start": "00:09:00.510", "time_end": "00:09:09.090", "dialogue": "Sophia Zhu: So I mean that's just suddenly switched on on to today's presenter mode and that's quite in Beijing."}, {"id": 71, "time_start": "00:09:12.150", "time_end": "00:09:16.530", "dialogue": "Kwong Yue Yang: yeah Luna just jumped into it, she didn't wait for me to say Okay, or anything."}, {"id": 72, "time_start": "00:09:17.040", "time_end": "00:09:18.990", "dialogue": "Kwong Yue Yang: wait for it wait for it and."}, {"id": 73, "time_start": "00:09:19.170", "time_end": "00:09:28.470", "dialogue": "Kwong Yue Yang: It was great because it got our attention she had that confidence in a voice and abroad us along and David presented, really, really well, he has very."}, {"id": 74, "time_start": "00:09:29.070", "time_end": "00:09:40.650", "dialogue": "Kwong Yue Yang: As harish mission articulates the words so well it's very clear and the sound quality, maybe, maybe david's done some voice work in the past but he's got a very nice and voice."}, {"id": 75, "time_start": "00:09:41.010", "time_end": "00:09:49.140", "dialogue": "Kwong Yue Yang: That gives you this sense of calm, but wanting to listen, a lot more, and then I think Paul did a good job of summarizing."}, {"id": 76, "time_start": "00:09:49.710", "time_end": "00:10:04.710", "dialogue": "Kwong Yue Yang: and highlighting those keywords that David also mentioned as well, but those key things like Ai big data it shows that we're learning and moving towards the future and we are part of that those one more sentence."}, {"id": 77, "time_start": "00:10:07.950", "time_end": "00:10:10.590", "dialogue": "Kwong Yue Yang: Oh, I think I think David said we're learning about."}, {"id": 78, "time_start": "00:10:12.000", "time_end": "00:10:13.830", "dialogue": "Kwong Yue Yang: Technology future technology we're."}, {"id": 79, "time_start": "00:10:13.830", "time_end": "00:10:25.740", "dialogue": "Kwong Yue Yang: Learning and we're using it as well, and so, if I was a graduate like Oh, this is fantastic I get to learn about it and put it in to action straightaway so."}, {"id": 80, "time_start": "00:10:25.800", "time_end": "00:10:26.820", "dialogue": "Kwong Yue Yang: it's mostly Paul."}, {"id": 81, "time_start": "00:10:28.440", "time_end": "00:10:28.920", "dialogue": "Kwong Yue Yang: Sorry."}, {"id": 82, "time_start": "00:10:29.760", "time_end": "00:10:35.130", "dialogue": "Arunabh Singh: That was for lighting, because he mentioned about the fact that we're not just talking about it but you're also using it."}, {"id": 83, "time_start": "00:10:35.910", "time_end": "00:10:39.600", "dialogue": "Kwong Yue Yang: Okay yeah it was mentioned, and it just is fantastic."}, {"id": 84, "time_start": "00:10:40.320", "time_end": "00:10:57.660", "dialogue": "David Hsu: The post on the right, I think that's the whole point right it goes back to the earlier one is connect and relate, so you need to say something so we we feel is vdi so we just need to build that in so, can you try to send that message through to them yeah great."}, {"id": 85, "time_start": "00:10:58.140", "time_end": "00:11:08.910", "dialogue": "Kwong Yue Yang: All those also one more sentence, the fight against financial crime, all of a sudden, I felt like oh I gotta gotta be a superhero I mean maybe not a superhero, but it was against something that's catchy."}, {"id": 86, "time_start": "00:11:09.660", "time_end": "00:11:12.270", "dialogue": "Kwong Yue Yang: is very memorable very."}, {"id": 87, "time_start": "00:11:12.390", "time_end": "00:11:15.750", "dialogue": "David Hsu: yeah it wasn't in the first rehearsal if you don't get me."}, {"id": 88, "time_start": "00:11:15.930", "time_end": "00:11:16.410", "dialogue": "David Hsu: Wrong I."}, {"id": 89, "time_start": "00:11:18.750", "time_end": "00:11:23.910", "dialogue": "David Hsu: Think of something that puts them in so it's at that came in and the second one wasn't in the first one."}, {"id": 90, "time_start": "00:11:26.070", "time_end": "00:11:32.940", "dialogue": "Kwong Yue Yang: And I think that's something we can also learn from as well, the first time we present versus the second time we present."}, {"id": 91, "time_start": "00:11:33.390", "time_end": "00:11:45.990", "dialogue": "Kwong Yue Yang: Maybe versus a third time we present you can make it better, each time like you think of different things that you may not have thought of at that point in time so doing a few runs it's always Nice."}, {"id": 92, "time_start": "00:11:49.350", "time_end": "00:11:50.700", "dialogue": "Oh we're gonna ask the second question."}, {"id": 93, "time_start": "00:11:53.370", "time_end": "00:11:55.020", "dialogue": "Kwong Yue Yang: Second question what's the second question."}, {"id": 94, "time_start": "00:11:57.630", "time_end": "00:11:59.010", "dialogue": "Lynette K: What could we have done better."}, {"id": 95, "time_start": "00:12:00.450", "time_end": "00:12:01.710", "dialogue": "Kwong Yue Yang: How could have been improved."}, {"id": 96, "time_start": "00:12:02.790", "time_end": "00:12:03.960", "dialogue": "Kwong Yue Yang: What could have been done better."}, {"id": 97, "time_start": "00:12:13.590", "time_end": "00:12:27.630", "dialogue": "Lexandra Confiado: I think all credit close in a much stronger tone and a little bit more energized The message was good, but ending ending well stronger would have been better."}, {"id": 98, "time_start": "00:12:30.540", "time_end": "00:12:36.930", "dialogue": "Kwong Yue Yang: To increase again that 5% that 5% to add a little bit more energy in there yep."}, {"id": 99, "time_start": "00:12:38.490", "time_end": "00:12:47.850", "dialogue": "Alyson Sosa: What else something a little more visual as well, so the words all good and the tone was good for the most part, but yeah nothing to catch your eye huh."}, {"id": 100, "time_start": "00:12:49.890", "time_end": "00:13:02.610", "dialogue": "Kwong Yue Yang: yeah so even even if it's a minute, if you add just one visual like one proper one image it could really capture people's attention straightaway, so what could be done there yeah anything else."}, {"id": 101, "time_start": "00:13:08.430", "time_end": "00:13:16.200", "dialogue": "Kwong Yue Yang: I think the only other thing is just maybe try a little bit more to look into the camera so trying to get engaged a bit more eye contact."}, {"id": 102, "time_start": "00:13:17.010", "time_end": "00:13:27.720", "dialogue": "Kwong Yue Yang: into the camera so that way, we can feel that connection, a bit more, it still felt like some some of you might have been looking at the screen more than at the camera so something that we can work on."}, {"id": 103, "time_start": "00:13:28.890", "time_end": "00:13:38.490", "dialogue": "Kwong Yue Yang: Right excellent all right around the closer that group again and I can't remember I gave a second round of applause for the first group so just in case will give them another round for us as well."}, {"id": 104, "time_start": "00:13:39.450", "time_end": "00:13:56.910", "dialogue": "Kwong Yue Yang: One thing that I want to quickly touch on before we get to the last group is this idea of statistics and numbers and this might be a good time to talk about it, so in that group they talked about 10.4 billion, I think it was 10.4 billion yep so."}, {"id": 105, "time_start": "00:13:58.530", "time_end": "00:14:03.840", "dialogue": "Kwong Yue Yang: How often you have to deal with statistics and numbers at city, and you have to present present them how often."}, {"id": 106, "time_start": "00:14:05.220", "time_end": "00:14:05.850", "dialogue": "Kwong Yue Yang: all the time."}, {"id": 107, "time_start": "00:14:05.940", "time_end": "00:14:06.330", "dialogue": "yeah."}, {"id": 108, "time_start": "00:14:07.410", "time_end": "00:14:27.270", "dialogue": "Kwong Yue Yang: yep and remember last week we talked about how we remember things in pictures and emotions that's how we remember things pictures and emotions, so when we give people numbers and statistics like that is often harder for them to just remember those numbers."}, {"id": 109, "time_start": "00:14:29.370", "time_end": "00:14:41.160", "dialogue": "Kwong Yue Yang: So what we want to do is try to think about a statistic or a data point and think about how we can make it more memorable how we can make it more memorable i'll give you a very."}, {"id": 110, "time_start": "00:14:42.180", "time_end": "00:14:46.530", "dialogue": "Kwong Yue Yang: i'll give you one statistic now, and I want you to think about how you might."}, {"id": 111, "time_start": "00:14:47.580", "time_end": "00:14:53.400", "dialogue": "Kwong Yue Yang: describe this statistic so you're painting a picture or evoking emotion."}, {"id": 112, "time_start": "00:14:55.350", "time_end": "00:15:03.840", "dialogue": "Kwong Yue Yang: So this is the statistic is 700,000 square kilometers 700,000 square Columbus i'll type that in the chat box."}, {"id": 113, "time_start": "00:15:09.000", "time_end": "00:15:12.930", "dialogue": "Kwong Yue Yang: that's the amount of rubbish that is floating in the Pacific Ocean."}, {"id": 114, "time_start": "00:15:14.580", "time_end": "00:15:17.100", "dialogue": "Kwong Yue Yang: that's the amount of rubbish floating in the Pacific Ocean."}, {"id": 115, "time_start": "00:15:18.960", "time_end": "00:15:28.500", "dialogue": "Kwong Yue Yang: i'm going to put you at quickly into breakout rooms how might you describe that statistic, so that is more visual and more emotional."}, {"id": 116, "time_start": "00:15:32.760", "time_end": "00:15:34.920", "dialogue": "Kwong Yue Yang: Just a quick breakout won't be long."}, {"id": 117, "time_start": "00:15:37.590", "time_end": "00:15:42.030", "dialogue": "Kwong Yue Yang: Two minutes, how could you take that statistic and make it more visual and more emotional."}, {"id": 118, "time_start": "00:15:43.050", "time_end": "00:15:47.520", "dialogue": "Kwong Yue Yang: 700,000 square kilometers is amount of rubbish floating in the Pacific Ocean."}, {"id": 119, "time_start": "00:16:17.760", "time_end": "00:16:24.030", "dialogue": "Kwong Yue Yang: Alright, hopefully, everybody each group came up with something or just ask a few groups to share let's ask."}, {"id": 120, "time_start": "00:16:25.320", "time_end": "00:16:29.100", "dialogue": "Kwong Yue Yang: let's see I think so, fear and allison What did you both come up with."}, {"id": 121, "time_start": "00:16:31.980", "time_end": "00:16:34.500", "dialogue": "Sophia Zhu: Thinking comparing it with the."}, {"id": 122, "time_start": "00:16:34.560", "time_end": "00:16:42.840", "dialogue": "Sophia Zhu: countryside or a emotional size in the same topic, for example, it is one 10th of the Amazon rainforest."}, {"id": 123, "time_start": "00:16:44.220", "time_end": "00:16:57.300", "dialogue": "Kwong Yue Yang: Right yes and comparing it to a country or something that people can visualize so For those of you who don't know 700,000 square kilometers it's about the same size as France."}, {"id": 124, "time_start": "00:16:59.700", "time_end": "00:17:19.920", "dialogue": "Kwong Yue Yang: So, by saying that people can see it straight away, otherwise, if you just give them that number they go oh it's big, but when you say is the size of France wow it's easier for them to visualize let's see let's ask any other ones, maybe David harish What did you come up with."}, {"id": 125, "time_start": "00:17:21.600", "time_end": "00:17:37.290", "dialogue": "Harish Ashok Mahadik: Something very similar I mean we we talked about the number that came up very quickly was Hong Kong is about 1100 square kilometres, and we said, this is the equivalent of 600 Hong kong's floating around and that's just the garbage that is there in the in the oceans David."}, {"id": 126, "time_start": "00:17:38.100", "time_end": "00:17:46.650", "dialogue": "David Hsu: yeah yeah exactly that's what that so so we think of geography at the time with us how to make an impact to make people think."}, {"id": 127, "time_start": "00:17:47.670", "time_end": "00:18:01.080", "dialogue": "Kwong Yue Yang: Correct and if your audience is based in Hong Kong, it makes a huge impact because they think Oh, every day, it takes me to get from Hong Kong island to North northern territories new territories, it takes me an hour on the train."}, {"id": 128, "time_start": "00:18:02.280", "time_end": "00:18:16.710", "dialogue": "Kwong Yue Yang: Now, imagine doing that 600 times and looking out and everywhere, I look is rubbish right, so it makes more of an impact yep great Lisa asked lynette arena, did you come up with anything else anything different."}, {"id": 129, "time_start": "00:18:17.430", "time_end": "00:18:32.490", "dialogue": "Lynette K: And we're very similar we use Hong Kong um, but I think another good example would be the United Kingdom so it's approximately three times just less than 3014 and kingdom before Hong Kong it's like more than like 100 times so."}, {"id": 130, "time_start": "00:18:33.510", "time_end": "00:18:35.160", "dialogue": "Lynette K: it'll be nice to have like."}, {"id": 131, "time_start": "00:18:35.370", "time_end": "00:18:36.180", "dialogue": "Lynette K: A single digit."}, {"id": 132, "time_start": "00:18:36.870", "time_end": "00:18:38.070", "dialogue": "Lynette K: Number versus."}, {"id": 133, "time_start": "00:18:39.510", "time_end": "00:18:40.770", "dialogue": "Lynette K: Number that's what we were thinking."}, {"id": 134, "time_start": "00:18:41.040", "time_end": "00:18:48.360", "dialogue": "Kwong Yue Yang: yeah yeah so it's again it's easier to visualize visualize if it's a single digit number, as opposed to."}, {"id": 135, "time_start": "00:18:50.250", "time_end": "00:19:00.390", "dialogue": "Kwong Yue Yang: A bigger number, but again depends on who your audiences knowing your audience right lastly lex and Paul was anything different or roughly the same."}, {"id": 136, "time_start": "00:19:02.130", "time_end": "00:19:09.390", "dialogue": "Lexandra Confiado: I think well roughly the same more focused, though, on the on the ocean or the see around us."}, {"id": 137, "time_start": "00:19:10.620", "time_end": "00:19:17.700", "dialogue": "Lexandra Confiado: And then, as an added kind of teaser to the to the visual is the sound of the waves or the water."}, {"id": 138, "time_start": "00:19:18.090", "time_end": "00:19:19.350", "dialogue": "Lexandra Confiado: With garbage."}, {"id": 139, "time_start": "00:19:19.470", "time_end": "00:19:25.800", "dialogue": "Lexandra Confiado: Just one to each other, because there's too much of it in the water, so that's what we ought to."}, {"id": 140, "time_start": "00:19:26.580", "time_end": "00:19:37.800", "dialogue": "Kwong Yue Yang: yeah wow I got goosebumps as soon as he started talking about the sounds and I started thinking about smells as well, so those are other senses, that we can connect to to make it more impactful."}, {"id": 141, "time_start": "00:19:38.400", "time_end": "00:19:48.180", "dialogue": "Paul Lee: yeah we also talked about the imagine you swim in the oceans and then this rubbish around so many people have to reach them."}, {"id": 142, "time_start": "00:19:48.660", "time_end": "00:19:53.280", "dialogue": "Kwong Yue Yang: yeah yeah so when you imagine that swimming that could be."}, {"id": 143, "time_start": "00:19:54.300", "time_end": "00:20:04.020", "dialogue": "Kwong Yue Yang: Oh i'm getting goosebumps just thinking about it now you have this really powerful when you when you connect with other people's other senses like smell and taste sound."}, {"id": 144, "time_start": "00:20:04.740", "time_end": "00:20:07.830", "dialogue": "Kwong Yue Yang: senses, we can invoke a lot of emotions well."}, {"id": 145, "time_start": "00:20:09.810", "time_end": "00:20:15.270", "dialogue": "Kwong Yue Yang: i'm going to give you a side tip side tip because Paul just mentioned, it is the word imagine."}, {"id": 146, "time_start": "00:20:16.650", "time_end": "00:20:20.160", "dialogue": "Kwong Yue Yang: Imagine imagine is a really powerful word."}, {"id": 147, "time_start": "00:20:21.330", "time_end": "00:20:28.590", "dialogue": "Kwong Yue Yang: I think we don't cover it, let me, let me just quickly check to make sure i'm not covering things that's that are coming out later."}, {"id": 148, "time_start": "00:20:32.850", "time_end": "00:20:40.680", "dialogue": "Kwong Yue Yang: yeah we're not covering it, so let me talk about it now imagine the reason why I imagine is such a powerful word."}, {"id": 149, "time_start": "00:20:40.740", "time_end": "00:20:42.870", "dialogue": "Kwong Yue Yang: Is because afterwards."}, {"id": 150, "time_start": "00:20:43.050", "time_end": "00:20:43.740", "dialogue": "is correct."}, {"id": 151, "time_start": "00:20:45.000", "time_end": "00:20:49.500", "dialogue": "Kwong Yue Yang: Anything you said afterwards is correct, because people are imagining it in their minds."}, {"id": 152, "time_start": "00:20:50.520", "time_end": "00:20:54.630", "dialogue": "Kwong Yue Yang: When you use the word imagine you can imagine the past the present."}, {"id": 153, "time_start": "00:20:55.890", "time_end": "00:20:59.730", "dialogue": "Kwong Yue Yang: Or the future I should do it this way past, present or the future."}, {"id": 154, "time_start": "00:21:01.740", "time_end": "00:21:05.790", "dialogue": "Kwong Yue Yang: But it can connect with your audience very quickly if I said."}, {"id": 155, "time_start": "00:21:07.080", "time_end": "00:21:19.440", "dialogue": "Kwong Yue Yang: Imagine a long, long time ago, when it came to the Internet, in order to joint connect to the Internet, you had to connect your phone and it would make this huge Sam."}, {"id": 156, "time_start": "00:21:21.570", "time_end": "00:21:27.540", "dialogue": "Kwong Yue Yang: And i'll take you five minutes, just to bring out one page right so let's imagine in the past."}, {"id": 157, "time_start": "00:21:28.920", "time_end": "00:21:41.640", "dialogue": "Kwong Yue Yang: Imagine in the present is imagine now when you go on the Internet, you can search on Google anything and everything just pops up in less than a second that's how powerful technology is right now."}, {"id": 158, "time_start": "00:21:44.880", "time_end": "00:22:05.670", "dialogue": "Kwong Yue Yang: Imagine in the future, imagine the future how one day we may just wear glasses and have a think of something and straightaway, the results will come out in front of us that's how powerful and that's the direction we're going in with technology Ai and big data let's talk about how city."}, {"id": 159, "time_start": "00:22:06.180", "time_end": "00:22:10.890", "dialogue": "Kwong Yue Yang: is riding that wave to stay in front of the competition."}, {"id": 160, "time_start": "00:22:14.670", "time_end": "00:22:17.610", "dialogue": "Kwong Yue Yang: So notice how imagine can be a very powerful statement."}, {"id": 161, "time_start": "00:22:18.870", "time_end": "00:22:22.890", "dialogue": "Kwong Yue Yang: So I covered a very briefly, but it's a good statement to use."}, {"id": 162, "time_start": "00:22:23.400", "time_end": "00:22:24.000", "dialogue": "Kwong Yue Yang: to launch."}, {"id": 163, "time_start": "00:22:24.060", "time_end": "00:22:27.090", "dialogue": "Kwong Yue Yang: A presentation, or even during conversation."}, {"id": 164, "time_start": "00:22:30.930", "time_end": "00:22:35.520", "dialogue": "Kwong Yue Yang: I digress I sidetracked one more thing, before we get to the last group."}, {"id": 165, "time_start": "00:22:36.750", "time_end": "00:22:40.170", "dialogue": "Kwong Yue Yang: What i'd like you to do is take your own State city statistic."}, {"id": 166, "time_start": "00:22:41.790", "time_end": "00:22:43.800", "dialogue": "Kwong Yue Yang: Your own city statistic or number."}, {"id": 167, "time_start": "00:22:45.240", "time_end": "00:22:51.540", "dialogue": "Kwong Yue Yang: And i'd like you to make it more memorable more visual and more emotional."}, {"id": 168, "time_start": "00:22:52.620", "time_end": "00:22:59.550", "dialogue": "Kwong Yue Yang: So, think about your own statistic or data point that you're using at work, make it more visual and more emotional."}, {"id": 169, "time_start": "00:23:01.440", "time_end": "00:23:05.370", "dialogue": "Kwong Yue Yang: Do you want some examples or your cater give it a go yourself."}, {"id": 170, "time_start": "00:23:10.200", "time_end": "00:23:18.300", "dialogue": "Kwong Yue Yang: looks at sounds like you know you had to give it a go yourself alright, so what i'll do is i'm going to put you in a new breakout rooms, I want you to take your own stress test."}, {"id": 171, "time_start": "00:23:19.890", "time_end": "00:23:20.790", "dialogue": "Kwong Yue Yang: statistic."}, {"id": 172, "time_start": "00:23:21.930", "time_end": "00:23:25.110", "dialogue": "Kwong Yue Yang: And I want you to make it more memorable and."}, {"id": 173, "time_start": "00:23:27.480", "time_end": "00:23:31.890", "dialogue": "Kwong Yue Yang: visual and emotional sorry we just lost someone like sandra's come back okay."}, {"id": 174, "time_start": "00:23:35.580", "time_end": "00:23:36.180", "dialogue": "off we go."}, {"id": 175, "time_start": "00:23:42.420", "time_end": "00:23:46.170", "dialogue": "Kwong Yue Yang: share your own one with your partner and then we'll bring you back."}, {"id": 176, "time_start": "00:24:16.470", "time_end": "00:24:28.530", "dialogue": "Kwong Yue Yang: Alright, show me your fingers right show me your fingers show me your fingers all right zero to 10 zero to 10 how much did you like your partners statistic or figure."}, {"id": 177, "time_start": "00:24:29.010", "time_end": "00:24:46.500", "dialogue": "Kwong Yue Yang: 10 was it was amazing they should be at our next city or hand speaking zero means I forgot what they said let's have a look zero to 10 person high numbers go some tans and sevens and eights all right, not a problems arena, who is your partner."}, {"id": 178, "time_start": "00:24:48.030", "time_end": "00:24:48.600", "dialogue": "Arunabh Singh: Irish."}, {"id": 179, "time_start": "00:24:48.900", "time_end": "00:24:52.800", "dialogue": "Kwong Yue Yang: Irish heritage, can you please share your statistic with us, please."}, {"id": 180, "time_start": "00:24:54.270", "time_end": "00:25:11.010", "dialogue": "Harish Ashok Mahadik: We we talked about a couple of numbers right, so the first one that we talked about which was not so nice was that city managers $2.2 trillion in client assets, which is the same as the entire GDP of UK so so that kind of puts things in perspective."}, {"id": 181, "time_start": "00:25:12.600", "time_end": "00:25:23.580", "dialogue": "Harish Ashok Mahadik: But he also came up with another way of comparing it so imagine that you had a listing of world's richest countries now if city or a country city, would be the richest country in the world."}, {"id": 182, "time_start": "00:25:24.390", "time_end": "00:25:28.680", "dialogue": "Harish Ashok Mahadik: So, by the way, I have not done my math or my research I don't think wealth, because I think it is."}, {"id": 183, "time_start": "00:25:30.810", "time_end": "00:25:34.170", "dialogue": "Harish Ashok Mahadik: But I really like the way it was presented, because you're also putting the."}, {"id": 184, "time_start": "00:25:34.530", "time_end": "00:25:41.910", "dialogue": "Arunabh Singh: Book statement of imagining right imagine if it was a country, it would have been the greatest country that was great."}, {"id": 185, "time_start": "00:25:42.450", "time_end": "00:25:46.530", "dialogue": "Kwong Yue Yang: yeah nice very it's very powerful using the imagined statement."}, {"id": 186, "time_start": "00:25:46.860", "time_end": "00:25:54.270", "dialogue": "Kwong Yue Yang: Comparing our country and then, when you think wow real to 12 biggest country, there are a lot of countries out there."}, {"id": 187, "time_start": "00:25:55.080", "time_end": "00:26:09.570", "dialogue": "Kwong Yue Yang: And it is the top biggest yeah so that that is a fantastic example opens up our minds nice alright let's see her, she also gave a 10 I guess your panel was arena, was it the same statistical."}, {"id": 188, "time_start": "00:26:09.660", "time_end": "00:26:11.220", "dialogue": "Arunabh Singh: same same statistics."}, {"id": 189, "time_start": "00:26:11.430", "time_end": "00:26:12.660", "dialogue": "Harish Ashok Mahadik: same same statistic yeah."}, {"id": 190, "time_start": "00:26:13.110", "time_end": "00:26:18.420", "dialogue": "Kwong Yue Yang: Okay it's another problem, yes, I saw lex lex he gave a 10 who is your partner."}, {"id": 191, "time_start": "00:26:19.320", "time_end": "00:26:23.700", "dialogue": "Lexandra Confiado: it's David I actually gave an eight because I don't know if the statistics are good."}, {"id": 192, "time_start": "00:26:25.980", "time_end": "00:26:27.120", "dialogue": "Lexandra Confiado: i'll let David speaking."}, {"id": 193, "time_start": "00:26:29.970", "time_end": "00:26:41.400", "dialogue": "David Hsu: What is what is the one number that everyone can resonate and identify when we're asked to present a number it's kind of difficult, because we all work in different countries."}, {"id": 194, "time_start": "00:26:41.940", "time_end": "00:26:51.390", "dialogue": "David Hsu: So we came up with an idea, the one number not only everyone will identify with but we'll get everyone emotional is city stock price."}, {"id": 195, "time_start": "00:26:52.440", "time_end": "00:27:10.620", "dialogue": "David Hsu: So last night the stock price closed at $68 Point six right, so I just want to show you this as i'm learned to show graphics I just want to see if I can do this not very successful trying to show my laptop okay."}, {"id": 196, "time_start": "00:27:10.980", "time_end": "00:27:22.920", "dialogue": "David Hsu: You can see this the stock price of city in the last two years it's gone down quite a bit if I use the same graph to show you the stock price of JPMorgan chase you see actually green."}, {"id": 197, "time_start": "00:27:23.310", "time_end": "00:27:36.450", "dialogue": "David Hsu: So maybe in a way it explains why we have a new CEO Jane frazier with a lot of different strategies and hope that you know, in a couple of years time we'll get all of these stock price moving back in the green direction."}, {"id": 198, "time_start": "00:27:39.120", "time_end": "00:27:46.410", "dialogue": "Kwong Yue Yang: Nice nice nice David, what did people like a lot of things in there, that I liked, but just on here, what did people notice."}, {"id": 199, "time_start": "00:27:46.470", "time_end": "00:27:49.230", "dialogue": "Arunabh Singh: What did David do it, just like the way David speaks I."}, {"id": 200, "time_start": "00:27:49.530", "time_end": "00:27:50.550", "dialogue": "Arunabh Singh: just want to keep hearing."}, {"id": 201, "time_start": "00:27:51.300", "time_end": "00:27:55.140", "dialogue": "Arunabh Singh: Let me be very honest he is a very, very organic speaker."}, {"id": 202, "time_start": "00:27:57.810", "time_end": "00:28:01.440", "dialogue": "Lexandra Confiado: I actually thought he was just talking in general on what."}, {"id": 203, "time_start": "00:28:01.470", "time_end": "00:28:02.490", "dialogue": "Our strategy was."}, {"id": 204, "time_start": "00:28:03.810", "time_end": "00:28:19.770", "dialogue": "Lexandra Confiado: He was already speaking about you know our presentation and I like that about him and it definitely made me a little bit emotional because I felt I really felt oh I froze."}, {"id": 205, "time_start": "00:28:21.990", "time_end": "00:28:33.990", "dialogue": "Harish Ashok Mahadik: And there is also an amazing amount of analysis in and listen in those 3540 seconds I mean whoa I mean it is hitting the nail on the head, it is a number which gets all of us emotional."}, {"id": 206, "time_start": "00:28:34.320", "time_end": "00:28:48.330", "dialogue": "Harish Ashok Mahadik: Right, it is actually not $68 666 dollars 80 cents and and you know the analysis is buying on you know the the transformation everything that we're going through a lot of it talks to numbers, so you know there's a lesson there."}, {"id": 207, "time_start": "00:28:49.230", "time_end": "00:28:56.250", "dialogue": "Arunabh Singh: And it is actually Muslim because there was one point of time when it had hit the rock bottom right and that was like the most."}, {"id": 208, "time_start": "00:28:59.040", "time_end": "00:29:06.570", "dialogue": "Arunabh Singh: embarrassing day for most of the people working in an organization and then from that what we have rose is also a story in itself, but it is a long way to go."}, {"id": 209, "time_start": "00:29:07.230", "time_end": "00:29:18.150", "dialogue": "David Hsu: But the problem is this this APP right doesn't show the rock bottom it's actually showing green, so I couldn't use that I have to go to the last few years, with otherwise I can't show the direct."}, {"id": 210, "time_start": "00:29:18.660", "time_end": "00:29:19.560", "dialogue": "Arunabh Singh: Less than $1."}, {"id": 211, "time_start": "00:29:19.950", "time_end": "00:29:20.250", "dialogue": "David Hsu: I know."}, {"id": 212, "time_start": "00:29:21.030", "time_end": "00:29:25.080", "dialogue": "David Hsu: I couldn't find that map I couldn't find that chart to show."}, {"id": 213, "time_start": "00:29:25.650", "time_end": "00:29:26.880", "dialogue": "Arunabh Singh: Unfortunately I."}, {"id": 214, "time_start": "00:29:28.170", "time_end": "00:29:29.250", "dialogue": "Arunabh Singh: Relating to the number."}, {"id": 215, "time_start": "00:29:29.820", "time_end": "00:29:30.120", "dialogue": "yeah."}, {"id": 216, "time_start": "00:29:31.680", "time_end": "00:29:39.870", "dialogue": "Kwong Yue Yang: If I had to summarize or two things that well there's probably more than two but to that popped into my mind, is one that David was."}, {"id": 217, "time_start": "00:29:40.500", "time_end": "00:29:47.610", "dialogue": "Kwong Yue Yang: New the audience knew all of you and you what would connect with you emotionally and that's something that he was able to do very quickly."}, {"id": 218, "time_start": "00:29:48.120", "time_end": "00:29:54.690", "dialogue": "Kwong Yue Yang: from someone who doesn't work in the industry, what I really liked was had David made it very visual for me."}, {"id": 219, "time_start": "00:29:55.170", "time_end": "00:30:03.870", "dialogue": "Kwong Yue Yang: And he had his mobile phone he had a very had that chart and I could see straight away what was happening, it was red and then for him to say JP Morgan is green."}, {"id": 220, "time_start": "00:30:04.590", "time_end": "00:30:15.690", "dialogue": "Kwong Yue Yang: straightaway I knew what it must feel like and so it's very simple is very digestible for someone who's, not even in the industry, so I thought, David you did a fantastic job there as well."}, {"id": 221, "time_start": "00:30:16.800", "time_end": "00:30:22.080", "dialogue": "Kwong Yue Yang: Also, what David did he knew that he was going to present on his phone so he turned off his virtual background."}, {"id": 222, "time_start": "00:30:23.280", "time_end": "00:30:24.030", "dialogue": "Kwong Yue Yang: I think this is."}, {"id": 223, "time_start": "00:30:24.300", "time_end": "00:30:30.480", "dialogue": "David Hsu: Why you tend to okay that's what I did is, I know it won't show otherwise, yes, my screen right so yeah you won't see it yeah."}, {"id": 224, "time_start": "00:30:30.750", "time_end": "00:30:41.250", "dialogue": "Kwong Yue Yang: yeah so being aware, being aware that the virtual background will stop that presentation, but he turned it off, so that he could share that with us pray stuff."}, {"id": 225, "time_start": "00:30:43.110", "time_end": "00:30:51.810", "dialogue": "Kwong Yue Yang: All right, let's go to Oh, I was gonna say the last group, but the last group is actually lex and harish Is that correct."}, {"id": 226, "time_start": "00:30:57.690", "time_end": "00:31:00.090", "dialogue": "Arunabh Singh: yeah right Oh, the Group of the presentation."}, {"id": 227, "time_start": "00:31:00.090", "time_end": "00:31:00.630", "dialogue": "Arunabh Singh: Okay, yes."}, {"id": 228, "time_start": "00:31:00.810", "time_end": "00:31:04.080", "dialogue": "Kwong Yue Yang: I started the Group of the final the group and the final presentation."}, {"id": 229, "time_start": "00:31:04.770", "time_end": "00:31:07.710", "dialogue": "Harish Ashok Mahadik: Okay, so you have not forgotten me and I was hoping that."}, {"id": 230, "time_start": "00:31:08.850", "time_end": "00:31:23.430", "dialogue": "Kwong Yue Yang: I haven't I haven't forgot it haha alright so whilst we're waiting or give her another two minutes to see if she can come back i'll share with you another teaching point, and this is idea of nonverbal communications nonverbal communications."}, {"id": 231, "time_start": "00:31:25.110", "time_end": "00:31:35.820", "dialogue": "Kwong Yue Yang: When we communicate Has anybody heard of the different percentage splits of how much of our communication comes through our body language our voice and our content."}, {"id": 232, "time_start": "00:31:37.050", "time_end": "00:31:40.170", "dialogue": "Kwong Yue Yang: Has anybody heard of those percentage splits in the past."}, {"id": 233, "time_start": "00:31:41.730", "time_end": "00:31:42.930", "dialogue": "Kwong Yue Yang: When we communicate."}, {"id": 234, "time_start": "00:31:44.130", "time_end": "00:31:46.170", "dialogue": "Kwong Yue Yang: There is this saying that."}, {"id": 235, "time_start": "00:31:47.700", "time_end": "00:31:50.130", "dialogue": "Kwong Yue Yang: 7% of our communication."}, {"id": 236, "time_start": "00:31:51.240", "time_end": "00:31:54.990", "dialogue": "Kwong Yue Yang: comes through our words 7% comes through our words."}, {"id": 237, "time_start": "00:31:56.370", "time_end": "00:31:59.640", "dialogue": "Kwong Yue Yang: 38% comes through the tone of our voice."}, {"id": 238, "time_start": "00:32:01.140", "time_end": "00:32:04.710", "dialogue": "Kwong Yue Yang: And 55% comes from our body language."}, {"id": 239, "time_start": "00:32:05.970", "time_end": "00:32:16.560", "dialogue": "Kwong Yue Yang: body language so it shows that body language and the tone of the voice the nonverbal sorry yeah the nonverbal communication is really important to get our message across."}, {"id": 240, "time_start": "00:32:18.330", "time_end": "00:32:19.710", "dialogue": "Kwong Yue Yang: i'll give you an example."}, {"id": 241, "time_start": "00:32:20.760", "time_end": "00:32:24.360", "dialogue": "Kwong Yue Yang: Everyone think of the sentence come over here come over here."}, {"id": 242, "time_start": "00:32:25.380", "time_end": "00:32:27.900", "dialogue": "Kwong Yue Yang: Now, how many people have kids how many people have kids."}, {"id": 243, "time_start": "00:32:28.950", "time_end": "00:32:36.660", "dialogue": "Kwong Yue Yang: yep every favor nieces and nephews yep I think i've asked this everybody who's been a kid before everyone has been a kid before."}, {"id": 244, "time_start": "00:32:39.690", "time_end": "00:32:43.500", "dialogue": "Kwong Yue Yang: What does this mean if I go up to a child, and I say this."}, {"id": 245, "time_start": "00:32:44.700", "time_end": "00:32:45.870", "dialogue": "Kwong Yue Yang: Come on kind of."}, {"id": 246, "time_start": "00:32:48.060", "time_end": "00:32:49.050", "dialogue": "Kwong Yue Yang: What am I, implying."}, {"id": 247, "time_start": "00:32:52.290", "time_end": "00:32:54.390", "dialogue": "Arunabh Singh: it's something exciting for."}, {"id": 248, "time_start": "00:32:54.480", "time_end": "00:32:54.600", "dialogue": "me."}, {"id": 249, "time_start": "00:32:55.770", "time_end": "00:33:01.800", "dialogue": "Kwong Yue Yang: yeah something exciting something something exciting a secret come over you, if I say it like this."}, {"id": 250, "time_start": "00:33:03.180", "time_end": "00:33:03.870", "dialogue": "Kwong Yue Yang: come over here."}, {"id": 251, "time_start": "00:33:06.540", "time_end": "00:33:07.170", "dialogue": "Kwong Yue Yang: come over here."}, {"id": 252, "time_start": "00:33:08.190", "time_end": "00:33:09.150", "dialogue": "Kwong Yue Yang: What am I, implying."}, {"id": 253, "time_start": "00:33:12.150", "time_end": "00:33:13.800", "dialogue": "Arunabh Singh: It is about to have a hard time."}, {"id": 254, "time_start": "00:33:13.950", "time_end": "00:33:29.700", "dialogue": "Kwong Yue Yang: yeah kids in trouble they're about to have a hard time, so you can see, the word come over here are exactly the same it's exactly the same, but the way I use my voice and my body language brings out different meaning."}, {"id": 255, "time_start": "00:33:31.440", "time_end": "00:33:37.440", "dialogue": "Kwong Yue Yang: So that's something to be realized that our body language and our voice can influence."}, {"id": 256, "time_start": "00:33:38.580", "time_end": "00:33:40.440", "dialogue": "Kwong Yue Yang: How it's received by our audience."}, {"id": 257, "time_start": "00:33:42.240", "time_end": "00:33:47.940", "dialogue": "Kwong Yue Yang: Now, often when you present How often do you spend time on the actual delivery side."}, {"id": 258, "time_start": "00:33:49.350", "time_end": "00:33:54.360", "dialogue": "Kwong Yue Yang: Health how much do you spend on the actual delivery side versus your content."}, {"id": 259, "time_start": "00:33:57.090", "time_end": "00:33:57.870", "dialogue": "Kwong Yue Yang: i'm gonna share with me."}, {"id": 260, "time_start": "00:34:00.450", "time_end": "00:34:02.700", "dialogue": "Kwong Yue Yang: lynette how much time do you spend on your content."}, {"id": 261, "time_start": "00:34:02.730", "time_end": "00:34:05.640", "dialogue": "Kwong Yue Yang: And how much time do you spend on delivery."}, {"id": 262, "time_start": "00:34:07.740", "time_end": "00:34:10.320", "dialogue": "Lynette K: Oh let's say a sound lot more time with the content."}, {"id": 263, "time_start": "00:34:10.740", "time_end": "00:34:16.620", "dialogue": "Kwong Yue Yang: yeah yeah a lot more time on the content yeah how about Paul how much time you spend on the content."}, {"id": 264, "time_start": "00:34:17.460", "time_end": "00:34:18.570", "dialogue": "Paul Lee: With the similar."}, {"id": 265, "time_start": "00:34:19.260", "time_end": "00:34:19.560", "dialogue": "Kwong Yue Yang: Similar."}, {"id": 266, "time_start": "00:34:19.590", "time_end": "00:34:21.210", "dialogue": "Kwong Yue Yang: A lot more time than the content and."}, {"id": 267, "time_start": "00:34:21.210", "time_end": "00:34:22.560", "dialogue": "Paul Lee: The content yeah."}, {"id": 268, "time_start": "00:34:22.950", "time_end": "00:34:46.230", "dialogue": "Kwong Yue Yang: So is content important yes content is king so still focus on the content, but what i'm trying to say is rather than any spend 1% of your time on the delivery try to spend a bit more 5% 10% maybe even 20%, because that will help you deliver your content more accurately and more smoothly."}, {"id": 269, "time_start": "00:34:48.360", "time_end": "00:34:51.360", "dialogue": "Kwong Yue Yang: Just like David earlier on in that his presentation."}, {"id": 270, "time_start": "00:34:52.650", "time_end": "00:35:09.120", "dialogue": "Kwong Yue Yang: After he did the first time, the second time he came up with that sentence fight against financial crime yeah so he could only come up with that because he did it once and then the second time he came up with some more ideas so try to build in some time to practice."}, {"id": 271, "time_start": "00:35:11.580", "time_end": "00:35:19.140", "dialogue": "Kwong Yue Yang: All right, we'll pause there oh look at that just one I was gonna say I was gonna give up on lex lex joins in."}, {"id": 272, "time_start": "00:35:20.820", "time_end": "00:35:23.640", "dialogue": "Kwong Yue Yang: that's perfect timing legs, I was just about to give up."}, {"id": 273, "time_start": "00:35:24.360", "time_end": "00:35:26.760", "dialogue": "Lexandra Confiado: I wasn't gonna give up on me to."}, {"id": 274, "time_start": "00:35:29.820", "time_end": "00:35:37.260", "dialogue": "Kwong Yue Yang: write so lex it's time for you to shine both you and Hirsch, are going to deliver your little."}, {"id": 275, "time_start": "00:35:38.490", "time_end": "00:35:42.270", "dialogue": "Kwong Yue Yang: 62nd pitch to the MBA students."}, {"id": 276, "time_start": "00:35:45.300", "time_end": "00:35:46.680", "dialogue": "Lexandra Confiado: Okay, just."}, {"id": 277, "time_start": "00:35:48.150", "time_end": "00:35:49.650", "dialogue": "Lexandra Confiado: Give me a second to set up."}, {"id": 278, "time_start": "00:36:05.010", "time_end": "00:36:07.110", "dialogue": "Lexandra Confiado: Can you see our screen my screen."}, {"id": 279, "time_start": "00:36:07.380", "time_end": "00:36:07.710", "dialogue": "yep."}, {"id": 280, "time_start": "00:36:09.030", "time_end": "00:36:09.360", "dialogue": "Kwong Yue Yang: Okay."}, {"id": 281, "time_start": "00:36:11.400", "time_end": "00:36:12.150", "dialogue": "Lexandra Confiado: let's get started."}, {"id": 282, "time_start": "00:36:16.020", "time_end": "00:36:22.620", "dialogue": "Harish Ashok Mahadik: You have proved that you are some of the best in your class you've proved that you have the drive and the ambition."}, {"id": 283, "time_start": "00:36:23.580", "time_end": "00:36:34.530", "dialogue": "Harish Ashok Mahadik: But, are you ready for what it takes, are you ready to join, one of the leading companies in the world of finance, which is present in around hundred and 35 countries in the world."}, {"id": 284, "time_start": "00:36:35.220", "time_end": "00:36:49.800", "dialogue": "Harish Ashok Mahadik: Are you ready to join a team of professionals of 200,000 inspired individuals around the world city news no introduction, but if you are keen, if you are interested let's hear a little bit more on what we have for you like."}, {"id": 285, "time_start": "00:36:52.080", "time_end": "00:36:57.390", "dialogue": "Lexandra Confiado: I am independent compliance risk management and I belong in city."}, {"id": 286, "time_start": "00:36:57.960", "time_end": "00:37:14.760", "dialogue": "Lexandra Confiado: In compliance we help a business, create a robust and integrated compliance and control environment that creates a culture of accountability ethical culture of excellence, as well as individual responsibility we have the seat at the table."}, {"id": 287, "time_start": "00:37:15.300", "time_end": "00:37:22.920", "dialogue": "Lexandra Confiado: And you will not find that anywhere else, and in city, we are partners not police officers that people tend to avoid."}, {"id": 288, "time_start": "00:37:23.730", "time_end": "00:37:34.680", "dialogue": "Lexandra Confiado: Do you want to be a part of an organization that values, accountability and responsibility, do you want to join an organization that values partnership and succeeding together."}, {"id": 289, "time_start": "00:37:35.370", "time_end": "00:37:45.510", "dialogue": "Lexandra Confiado: I want you to imagine, where in this House, you could belong to, if you join us if you want to be part of this journey of transforming city."}, {"id": 290, "time_start": "00:37:46.590", "time_end": "00:37:56.010", "dialogue": "Lexandra Confiado: and its compliance function in best in class come join us and you will know that we also have fun, because we are very passionate in what we do."}, {"id": 291, "time_start": "00:37:57.120", "time_end": "00:38:15.390", "dialogue": "Lexandra Confiado: let's raise the bar together let's do it together because combined with your credentials your skills and knowledge, we can definitely bring city to the next level and maintain the brand that talks of standards of excellence, culture and strong risk and control environment."}, {"id": 292, "time_start": "00:38:22.140", "time_end": "00:38:23.760", "dialogue": "Kwong Yue Yang: Nice work nice leg."}, {"id": 293, "time_start": "00:38:25.980", "time_end": "00:38:30.270", "dialogue": "Kwong Yue Yang: Ralph falls, maybe stop sharing the screen for a second, so we can see everyone."}, {"id": 294, "time_start": "00:38:32.430", "time_end": "00:38:34.650", "dialogue": "Kwong Yue Yang: likes what's the question that you'd like to ask."}, {"id": 295, "time_start": "00:38:40.440", "time_end": "00:38:42.960", "dialogue": "Kwong Yue Yang: What did I do well, what did I do well."}, {"id": 296, "time_start": "00:38:44.340", "time_end": "00:38:49.050", "dialogue": "Sophia Zhu: I really felt the passion in both sessions is very emotional."}, {"id": 297, "time_start": "00:38:49.740", "time_end": "00:38:53.760", "dialogue": "Kwong Yue Yang: and passion, the emotions for this book yeah what else."}, {"id": 298, "time_start": "00:38:58.410", "time_end": "00:39:16.440", "dialogue": "David Hsu: I need to ask her, which I find it virtually like fun listening to you because I don't know whether you intend to do it that way it's almost like preaching to someone but it's almost like a funny way that that hooks me, so I don't know whether it doesn't sound like your normal."}, {"id": 299, "time_start": "00:39:16.980", "time_end": "00:39:22.530", "dialogue": "Harish Ashok Mahadik: Right I I don't know David, I think it was the 5% extra going into a little bit of an overdrive but."}, {"id": 300, "time_start": "00:39:26.580", "time_end": "00:39:35.130", "dialogue": "Harish Ashok Mahadik: Honestly, I would normally not not speak like that in I guess it's the context which is, which is underscoring the little bit of that so."}, {"id": 301, "time_start": "00:39:36.930", "time_end": "00:39:41.130", "dialogue": "Harish Ashok Mahadik: And maybe I should think that is a woman for the next question on what can be improved, so thank you."}, {"id": 302, "time_start": "00:39:44.670", "time_end": "00:39:47.010", "dialogue": "Kwong Yue Yang: What else What else do people I run up."}, {"id": 303, "time_start": "00:39:47.910", "time_end": "00:40:05.100", "dialogue": "Arunabh Singh: I mean the way the product, the slide and the second slide not just one slide just goes to show that how well prepared the end to use that same amount of time that we all got but to add that touch was absolutely amazing I mean kudos to what they've done."}, {"id": 304, "time_start": "00:40:06.210", "time_end": "00:40:11.370", "dialogue": "Kwong Yue Yang: So they used a visual user slide to try drawing our attention right."}, {"id": 305, "time_start": "00:40:11.850", "time_end": "00:40:20.460", "dialogue": "David Hsu: i'll give a comment that I don't know whether it's correct and Kwan you can let me know how I feel so lack spoke very well very articulately."}, {"id": 306, "time_start": "00:40:21.900", "time_end": "00:40:33.990", "dialogue": "David Hsu: But I think in a way we're pitching to the MBA student right, so I want a bit more warmth and that makes me think of when you hear Jane frazier speak or Mary mcniff speaks."}, {"id": 307, "time_start": "00:40:34.260", "time_end": "00:40:49.380", "dialogue": "David Hsu: You see, that projection this you're very professional in the way that you described it, so I like it, but if you're pitching to the nba, I would like that to be added a little bit more my personal view."}, {"id": 308, "time_start": "00:40:51.390", "time_end": "00:40:52.710", "dialogue": "Lexandra Confiado: No that's a fair point."}, {"id": 309, "time_start": "00:40:54.420", "time_end": "00:40:54.810", "dialogue": "Lexandra Confiado: I can."}, {"id": 310, "time_start": "00:40:55.050", "time_end": "00:40:57.060", "dialogue": "Arunabh Singh: Actually, I would have come to that in the what."}, {"id": 311, "time_start": "00:40:57.060", "time_end": "00:40:58.920", "dialogue": "Arunabh Singh: could have been done better as well because."}, {"id": 312, "time_start": "00:40:58.920", "time_end": "00:41:04.110", "dialogue": "Arunabh Singh: I felt that, when there was a point in time when there was mention of do you want."}, {"id": 313, "time_start": "00:41:04.740", "time_end": "00:41:13.350", "dialogue": "Arunabh Singh: Do you want three or four times, I think it can be revisited if you wish to join something like that, because otherwise they would be a bit."}, {"id": 314, "time_start": "00:41:13.800", "time_end": "00:41:25.590", "dialogue": "Arunabh Singh: On the backside to say question themselves do you want might take them in a negative connotation, and that that was my only comment which I felt very rightly pointed out, it."}, {"id": 315, "time_start": "00:41:28.140", "time_end": "00:41:30.630", "dialogue": "Kwong Yue Yang: looks like we're moving into the second part of that question."}, {"id": 316, "time_start": "00:41:32.310", "time_end": "00:41:37.470", "dialogue": "Kwong Yue Yang: So I run over Dave had mentioned something just on that I was thinking."}, {"id": 317, "time_start": "00:41:38.820", "time_end": "00:41:46.080", "dialogue": "Kwong Yue Yang: Now the rooms mentioned it, I yeah the wording, the do you want versus was the other wedding you had arena."}, {"id": 318, "time_start": "00:41:46.710", "time_end": "00:41:47.850", "dialogue": "Arunabh Singh: If you wish to join a."}, {"id": 319, "time_start": "00:41:47.880", "time_end": "00:41:49.410", "dialogue": "Kwong Yue Yang: company or an organization."}, {"id": 320, "time_start": "00:41:49.440", "time_end": "00:41:50.460", "dialogue": "Kwong Yue Yang: If you wish to join."}, {"id": 321, "time_start": "00:41:51.570", "time_end": "00:41:57.510", "dialogue": "Kwong Yue Yang: Then that goes yeah, of course, I want to, I want to join a company like that, so it might be a bit softer bit nicer."}, {"id": 322, "time_start": "00:41:58.410", "time_end": "00:42:07.290", "dialogue": "Kwong Yue Yang: As also considering maybe you could just say join a company that will help you X X X X join a company that will why why why why join a company that didn't."}, {"id": 323, "time_start": "00:42:07.890", "time_end": "00:42:18.240", "dialogue": "Kwong Yue Yang: Join city, because we can achieve all these things so that would be more of an inspirational type of one maybe not as warm but something to think about as well yeah."}, {"id": 324, "time_start": "00:42:19.500", "time_end": "00:42:20.400", "dialogue": "Kwong Yue Yang: Anything else."}, {"id": 325, "time_start": "00:42:21.810", "time_end": "00:42:25.860", "dialogue": "Arunabh Singh: last thing was, I felt that probably was two minutes and not 60 seconds."}, {"id": 326, "time_start": "00:42:27.750", "time_end": "00:42:28.200", "dialogue": "Arunabh Singh: Because."}, {"id": 327, "time_start": "00:42:28.770", "time_end": "00:42:31.500", "dialogue": "Arunabh Singh: I mean, I would have also love to say it."}, {"id": 328, "time_start": "00:42:31.500", "time_end": "00:42:31.980", "dialogue": "For."}, {"id": 329, "time_start": "00:42:33.150", "time_end": "00:42:35.730", "dialogue": "Arunabh Singh: More than 60 seconds yeah."}, {"id": 330, "time_start": "00:42:36.090", "time_end": "00:42:40.740", "dialogue": "Kwong Yue Yang: So just the timing just control the time a little bit so condense that time."}, {"id": 331, "time_start": "00:42:41.910", "time_end": "00:42:45.450", "dialogue": "Kwong Yue Yang: I think, maybe because those that passion, it came out more, but sometimes."}, {"id": 332, "time_start": "00:42:46.080", "time_end": "00:42:47.370", "dialogue": "Kwong Yue Yang: We still need to be able to."}, {"id": 333, "time_start": "00:42:48.780", "time_end": "00:42:55.470", "dialogue": "Kwong Yue Yang: Control that time if we're talking to a CEO or an executive and they say i've only got five minutes for you."}, {"id": 334, "time_start": "00:42:56.610", "time_end": "00:43:07.170", "dialogue": "Kwong Yue Yang: You can only speak to them for five minutes right you can't go over that time so it's just good practice to try to get rid of the good and keep the great get rid of the good keep the great."}, {"id": 335, "time_start": "00:43:10.050", "time_end": "00:43:11.100", "dialogue": "Kwong Yue Yang: Any other thoughts."}, {"id": 336, "time_start": "00:43:14.460", "time_end": "00:43:17.310", "dialogue": "Kwong Yue Yang: The only other little thing I would add, is."}, {"id": 337, "time_start": "00:43:20.460", "time_end": "00:43:28.890", "dialogue": "Kwong Yue Yang: I like the fact that we use slides That was the slides we use if you are given more time I would probably simplify those slides."}, {"id": 338, "time_start": "00:43:29.700", "time_end": "00:43:39.690", "dialogue": "Kwong Yue Yang: So simplify the slides so that people don't have to read so much text so there's quite a lot of text you because you only have a minute, maybe just have those images."}, {"id": 339, "time_start": "00:43:40.470", "time_end": "00:43:51.630", "dialogue": "Kwong Yue Yang: will have the key The key phrase across the top some of that text in that middle I was trying to read and listen, at the same time yeah so try to reduce some of that text."}, {"id": 340, "time_start": "00:43:53.130", "time_end": "00:44:00.150", "dialogue": "Harish Ashok Mahadik: I, I think that that's valid feedback, in fact, you know we heard a version, where we wanted to use no text at all just use pictures."}, {"id": 341, "time_start": "00:44:01.500", "time_end": "00:44:16.920", "dialogue": "Harish Ashok Mahadik: But I you know, ultimately, we landed on the text because we thought the city mission statement is a very powerful piece of communication which we and and honestly, all of us are so familiar with, so if you minimize all windows on any of our desktops, that is what you will see."}, {"id": 342, "time_start": "00:44:17.370", "time_end": "00:44:21.930", "dialogue": "Harish Ashok Mahadik: So it is something that we are intimately familiar with right so to us it, it looks very."}, {"id": 343, "time_start": "00:44:24.900", "time_end": "00:44:27.810", "dialogue": "Harish Ashok Mahadik: Something that you're very keenly aware of."}, {"id": 344, "time_start": "00:44:29.100", "time_end": "00:44:30.780", "dialogue": "Harish Ashok Mahadik: But one day long, I think."}, {"id": 345, "time_start": "00:44:32.400", "time_end": "00:44:43.470", "dialogue": "Kwong Yue Yang: All the other alternative would be to start off with some start off with the way you wanted to start her ish started off and then just take and then pause and just say i'd like you all, just to reward."}, {"id": 346, "time_start": "00:44:43.470", "time_end": "00:44:43.950", "dialogue": "David Hsu: Your story."}, {"id": 347, "time_start": "00:44:45.480", "time_end": "00:44:47.220", "dialogue": "Kwong Yue Yang: So that way it gives people time to."}, {"id": 348, "time_start": "00:44:47.220", "time_end": "00:44:47.760", "dialogue": "Read."}, {"id": 349, "time_start": "00:44:48.930", "time_end": "00:44:52.020", "dialogue": "Kwong Yue Yang: As opposed to listen and read at the same time, which might be hard."}, {"id": 350, "time_start": "00:44:54.660", "time_end": "00:45:02.250", "dialogue": "Kwong Yue Yang: I was also wondering whether you'd throw in your new statistic about city, being the 12th biggest country that would have been a nice book."}, {"id": 351, "time_start": "00:45:02.760", "time_end": "00:45:04.980", "dialogue": "Harish Ashok Mahadik: I thought about it, and then you know."}, {"id": 352, "time_start": "00:45:06.030", "time_end": "00:45:08.550", "dialogue": "Harish Ashok Mahadik: We just decided to go with the original script so yeah."}, {"id": 353, "time_start": "00:45:08.580", "time_end": "00:45:10.140", "dialogue": "Kwong Yue Yang: No, no problems, no problems."}, {"id": 354, "time_start": "00:45:11.280", "time_end": "00:45:27.840", "dialogue": "Kwong Yue Yang: lot of great things there one more thing i'll add on the positives before we wrap up is I also like like Sandra how how you use your body language so lex is actually really using a lot of that space, as she speaks So hopefully everybody noticed that."}, {"id": 355, "time_start": "00:45:28.080", "time_end": "00:45:30.030", "dialogue": "Kwong Yue Yang: And everybody will start doing that as well."}, {"id": 356, "time_start": "00:45:30.360", "time_end": "00:45:36.570", "dialogue": "Kwong Yue Yang: use that space around you to your advantage, open up your hands, make it more dynamic, as you speak."}, {"id": 357, "time_start": "00:45:39.180", "time_end": "00:45:45.960", "dialogue": "Kwong Yue Yang: to oppose them and we're going to wrap up very quickly i'll just share."}, {"id": 358, "time_start": "00:45:48.240", "time_end": "00:45:50.730", "dialogue": "Kwong Yue Yang: What some of the things that we talked about today."}, {"id": 359, "time_start": "00:45:52.020", "time_end": "00:45:56.250", "dialogue": "Kwong Yue Yang: Because today, it was a bit more of a fluid session last session."}, {"id": 360, "time_start": "00:45:58.800", "time_end": "00:46:00.150", "dialogue": "Kwong Yue Yang: Is my screen OK."}, {"id": 361, "time_start": "00:46:03.090", "time_end": "00:46:10.830", "dialogue": "Kwong Yue Yang: So today we spend a little bit more time on strong language, which was taking those statistics and making them more memorable."}, {"id": 362, "time_start": "00:46:12.660", "time_end": "00:46:21.060", "dialogue": "Kwong Yue Yang: We try to start with the same so for those presentations that you did many of you did a really good job at hooking the audience, at the very beginning."}, {"id": 363, "time_start": "00:46:22.320", "time_end": "00:46:38.220", "dialogue": "Kwong Yue Yang: emotional connection, making sure that we can connect with our audience emotionally, what are you doing to make it more relevant to them so David did a good job with the share prices, for example, or runner talked about 10 years ago I was an MBA student as well."}, {"id": 364, "time_start": "00:46:40.830", "time_end": "00:46:51.870", "dialogue": "Kwong Yue Yang: Change creates energy I didn't get a chance to talk about, but the idea of change creates energy is that whenever you make a change you're adding energy back into the audience."}, {"id": 365, "time_start": "00:46:53.280", "time_end": "00:46:55.020", "dialogue": "Kwong Yue Yang: So when you change the speaker's."}, {"id": 366, "time_start": "00:46:56.730", "time_end": "00:47:01.590", "dialogue": "Kwong Yue Yang: Energy goes back into the audience because they're listening to a new voice they're looking at somebody else."}, {"id": 367, "time_start": "00:47:02.610", "time_end": "00:47:10.170", "dialogue": "Kwong Yue Yang: So when you present what can you do every five or 10 minutes to change things up, if you need to to add energy back."}, {"id": 368, "time_start": "00:47:13.410", "time_end": "00:47:25.170", "dialogue": "Kwong Yue Yang: On your screen again talking about how we can make use of that screen space using your body language to fill that space up and the last thing was know your audience and I think everyone did this really well."}, {"id": 369, "time_start": "00:47:26.520", "time_end": "00:47:37.620", "dialogue": "Kwong Yue Yang: In your mind you knew who the audience was the MBA students and you crafted the message for them, when I went into the groups, everybody was discussing oh MBA students, what would they be interested in."}, {"id": 370, "time_start": "00:47:38.880", "time_end": "00:47:47.340", "dialogue": "Kwong Yue Yang: And that's a good habit to get into whenever you have to present identify who your audiences and what's most important to them."}, {"id": 371, "time_start": "00:47:51.780", "time_end": "00:48:01.530", "dialogue": "Kwong Yue Yang: last thing i'll just share we're going back to that whole idea of that two minute presentations so just remember to keep that in mind, think about how you're going to start with the same."}, {"id": 372, "time_start": "00:48:03.720", "time_end": "00:48:08.280", "dialogue": "Kwong Yue Yang: Think about how you're going to bridge from that scene into the main content."}, {"id": 373, "time_start": "00:48:11.850", "time_end": "00:48:16.980", "dialogue": "Kwong Yue Yang: Think about using a slide or proper visual to change things up."}, {"id": 374, "time_start": "00:48:18.150", "time_end": "00:48:20.940", "dialogue": "Kwong Yue Yang: And then think about how you're going to close back into the opening."}, {"id": 375, "time_start": "00:48:22.350", "time_end": "00:48:29.040", "dialogue": "Kwong Yue Yang: So just some other things, to think about throughout the rest of the sessions, or you can use this format, when you present."}, {"id": 376, "time_start": "00:48:33.450", "time_end": "00:48:36.900", "dialogue": "Kwong Yue Yang: Any any questions any questions or any thoughts."}, {"id": 377, "time_start": "00:48:38.820", "time_end": "00:48:39.870", "dialogue": "Kwong Yue Yang: From today's session."}, {"id": 378, "time_start": "00:48:41.010", "time_end": "00:48:41.490", "dialogue": "Kwong Yue Yang: Oh good."}, {"id": 379, "time_start": "00:48:43.410", "time_end": "00:48:53.730", "dialogue": "Kwong Yue Yang: yeah all right excellent, thank you very much, everyone for your time as per usual Let me return some time back into your day and i'll see or."}, {"id": 380, "time_start": "00:48:54.090", "time_end": "00:49:04.230", "dialogue": "Kwong Yue Yang: Next week, where we're going to focus a lot more on delivery using your voice using your body language more effectively okay excellent we'll see you next week."}]